---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AreaLoad
source: html/09dbcdc8-e3b9-35d3-34aa-977e3119e3d8.htm
---
# AreaLoad Members

Checks if curve loops are valid for creating an area load.